import Classes.Cat;

public class Task03 {
    /*
    1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для приложения, которое является
        а) информационной системой ветеринарной клиники
        б) архивом выставки котов
        в) информационной системой Театра кошек Ю. Д. Куклачёва
    Можно записать в текстовом виде, необязательно реализовывать в java.
     */
    public static void main(String[] args) {
        Cat cat = new Cat("Мурзик");
        System.out.println(cat);
    }
}
